;# **************************************************************************** #
;#                                                                              #
;#                                                         :::      ::::::::    #
;#    libasm                                             :+:      :+:    :+:    #
;#                                                     +:+ +:+         +:+      #
;#    By: tsaiyan <tsaiyan@42.fr>                    +#+  +:+       +#+         #
;#                                                 +#+#+#+#+#+   +#+            #
;#    Created: 2021/03/16 21:29:30 by tsaiyan           #+#    #+#              #
;#    Updated: 2021/03/16 21:29:32 by tsaiyan          ###   ########.fr        #
;#                                                                              #
;# **************************************************************************** #

global _ft_strlen

section .text
_ft_strlen:
.main:
		xor rax, rax				; зануление возвращаемого значения
		cmp rdi, 0					; проверка на NULL
		je .exit
.cycle:
		cmp  byte [rdi + rax], 0	; разименование со смещением на n
		je .exit					; если cmp = 0, выход
		inc rax						; i++
		jmp .cycle					; безусловный переход
	
.exit:
		ret							; return
